#+property: board-name    Proplyd bowshocks
#+property: board-id      52091a8e59aa475c0d005603
#+property: DONE nil
#+property: TODO 52091a902f8f2d7c7e009182
High-level description of analysis of proplyd bowshocks

* Weekly meetings

** [2016-04-15 Fri]

*** Completed tasks

**** Figure 7
+ Jorge made a new version that includes the bowshock shapes for isotropic and non-isotropic winds
+ Will and Jorge re-wrote the figure caption

**** Figure 2
+ Jorge has added the asymptotic angle
+ A few things still to fix, see below

*** Next tasks

+ [ ] *Jorge* Figure 2
  + Add symmetry axis as solid line
  + Thicker lines for R90 and R0, Rc
  + Very thick line for shell
  + Maybe extend box further in negative /y/ direction
+ [ ] *Jorge*  Carry on with the \theta_c work from last week
+ [ ] *Will* New version of Figure 1, as described last week


** [2016-04-12 Tue]
We are revising section 5 of the paper
*** Restructuring model treatments in the paper
+ Currently, there is no relation between the Conic Section part of the paper and the following parts
+ It would be better to employ the conic section approximations in the discussion of the proplyds
+ To do this, we need to relate the CRW solutions to the shape parameters in the conic approximations
  + A - measures the radius of curvature
    + We had an analytic approximation that A(beta) is the same for proplyd and isotropic case
    + However, that is not consistent with our numerical solution for the CRW R_c in the proplyd and isotropic cases
    + *But* that is because the numerical R_c is from a fit over a wide range of angles from the axis, so it is influenced by the \theta_c as well as the true R_c
      + Of course, that has the advantage that we have a similar methodology between the determination of shape parameters for the theoretical and observational shells
      + But it would be a greater advantage to be able to easily relate the CRW shells to conic parameters
      + Then we can easily consider a wider range of shapes than the CRW solutions allow
      + We can also generalise the proplyd wind models to steeper dependencies of momentum on \theta (thus changing the parameter \xi in the formula for \theta_c as a function of \beta)
  + \theta_c relates to the type of conic, which we fix using R_90
    + \theta_c > 0 is ellipse
    + \theta_c < 0 is hyperbola
+ New plan for comparison with observations
  + We now have three different dimensions to the models:
    1. \beta - axial momentum ratio
    2. inclination
    3. \xi or \theta_c - depends on fall-off of proplyd flow momentum away from axis
       - or alternatively, can just be a shape parameter to describe deviations from the CRW model
  + So, we can compare the observations with different sets of (\beta, i) curves for different values of \xi
    + \xi = 1 - isotropic
    + \xi = 0.8 - classical proplyd: n \propto cos^{1/2} \theta
    + \xi < 0.8 - might fit majority of points better
      + Try and relate \xi to index of momentum variation with \theta
    + \xi > 1 - should fit LV4 better
      + Could argue that it is instability in shell (changes seen between epochs)
      + If it were steady-state, then we need momentum /increasing/ with \theta in proplyd flow
  + [ ] *Jorge* prepare some figures comparing conic models for different values of \xi
    + Use the \theta_c(\beta, \xi) equation:
    + \[ \tan^2 \theta_{c} = 3 \left[ \frac{\xi (1 + \beta^{1/2})^{2}}{(1 - \beta)^{2} (1 + \frac15 \beta)}  - \frac{1}{1 - \beta^{1/2}} \right] \]
    + Python version
      #+BEGIN_SRC python
        def A(beta):
            return 1.5/(1.0 - np.sqrt(beta))

        def thc(beta, xi=1.0):
            arg = 3*(1.0/(1.0 - np.sqrt(beta)) - xi*(1.0 + np.sqrt(beta))**2/(1.0 - xi*beta)**2/(1 + 0.2*xi*beta))
            return np.sign(arg)*np.arctan(np.sqrt(np.abs(arg)))


      #+END_SRC
*** Figures that need attention
**** Figure 1 showing schematic of two-wind interaction
+ Should not necessarily include \theta_1
+ Should show two shocks and contact discontinuity, and possibly streamlines too
+ [ ] *Will* can do a version based on previous LL figures
**** Figure 2 showing bowshock parameters R_0, R_90, etc
+ [X] *Jorge* Should add in \theta_\infty

**** Figure 7 showing bowshock shapes in the CRW approximation
+ [X] *Jorge* should also include the isotropic shapes for the same beta in this graph
** [2016-03-04 Fri]

*** Bowshock fits
+ There is a problem with the algorithm ignoring points due to the +/- 45 degree cut-off
  + Jorge will try using all the points in the fit
+ We would like a way to assign weights to the points
  + Points further from the axis will be less well determined
  + Solution: vary spacing between points so that they are closer together in regions where we have more confidence in the measurements
+ We have discovered that most of the measurements are for the outer boundary, which is theoretically simpler because it should correspond directly to the momentum balance surface
+ Will has found better images, which are astrometrically aligned
  + This allows us to see which shocks are stationary and which are moving
  + LV1 shock is clearly non-stationary (but we are not using it anyway)
  + LV2b is stationary with respect to the proplyd, but the proplyd is moving!
  + LV4 seems to have sharpened up, especially in the wings, and the ings have opened slightly.  But it seems stable on the axis
+ There is a new image from 2015, which we should look at
  + Will needs to do the drizzling and astrometric alignment
+ Jorge should stop working on the fits until all the images are sorted out
+ Jorge will revise the entire article to check which sections still need more attention

* Empirical material to include in Paper 1

** TODO New method of measuring the uncertainty in the bow shock R_0 and R_c measurements  
+ Do further fits, but each time removing one point from the points that are fitted
  + Remove each point in turn
  + Or perhaps take random samples of 50% of the points, which might be better if there are a lot of points
+ This will give an envelope in (R_0/D, R_c/R_0) space
+ We could then show that directly, or fit an ellipse to the convex hull, or something ...
** Notes on individual shocks

*** LV3 
+ Very thin shell
+ Very faint in [O III]
+ NE portion of bow is measured in continuum image since it is not visible in [O III]
*** LV2
+ Shell is very thick
+ Comprises overlapping filaments
+ I have taken the outermost envelope for the shape
+ The innermost two filaments, including one that bridges towards the LV2b shell, both seem to be moving S towards the main shell
+ There is a microjet pointing to the SE, but that does not seem to be interacting with the other features
*** LV2b
+ Some evidence that both proplyd and shock are moving south at about 10 km/s (1 pixel in 10 years)
+ But shell is stationary in frame of proplyd
+ The one I measure is the inner front-facing shell,
+ But there is also a partial shell outside that, which seems to be the extension of some of the LV2 filaments, and at least part of this has a proper motion towards the NW
+ Finally, there is a thick clumpy shell between the flanks of LV2 and LV2b
*** LV1 and LV1b
+ Shells are complex and clearly moving so we do not include them
*** LV4 
+ Some evidence in change in morphology between epochs
+ *But* it can partially be explained by the wider filter of the ACS letting in more continuum, which causes the shell to be contaminated with PSF from th1C
+ Also, there may be a faint fast-moving feature crossing LV4, possibly related to the other shocks crossing around LV5
*** 177-341
+ SW side is possibly affected by neighbouring 173-341
+ Faint moving features are crossing the position of proplyd, but don't affect main shell
*** 180-331
+ Very asymmetric shock
+ May be binary Proplyd
  + Double-lobed structure in [O III], but looks smoother in lower ionization lines
  + Some evidence from F850LP image, which shows continuum excess (due to star?) in only one of the two lobes
+ Shock may continue to SE
  + But it is has high proper-motion feature superimposed so it is hard to say


** New aligned images
+ In =Dropbox/JorgeBowshocks/HST=
+ =fr505n-5007-align-rob_drz_sci.fits=
  + ACS ramp filter
+ =f502n-allpc-align-rob_drz_sci.fits=
  + WFPC2 PC mosaic
** Jorge's question [2016-02-12 Fri]
Relayed by Jane via Skype
#+BEGIN_QUOTE
Las leyendas de las figuras de los ajustes de los proplyds no coinciden con la información de la tabla que llené para el artículo. La cual según recuerdo, fueron las mediciones más actualizadas que hicimos. Revisando el archivo de donde saqué las mediciones, hay otras tablas donde sí coinciden los datos de la tabla con las leyendas de las figuras y no recuerdo bien cómo obtuvimos las últimas mediciones
#+END_QUOTE

* Bowshock shapes
:PROPERTIES:
:orgtrello-id: 52091ab8c54dfb63510021f0
:END:

+ Purely empirical analysis of the shapes gives three fundamental parameters:
  + Projected distance: \(D'\)
  + Projected stand-off radius: \(R_0'\)
  + Projected radius of curvature: \(R_{\mathrm{c}}'\)
+ For a given model of the two winds (e.g., inner proplyd + outer isotropic), then we theoretically calculate \((R_0' / D', R_{\mathrm{c}}' / R_0') \) as a function of \(\beta, i\) where \(\beta\) is the wind-wind momentum flux ratio and \(i\) is the inclination. 

* Wind-wind proplyd models
:PROPERTIES:
:orgtrello-id: 52091abaa4cb978f7300333b
:END: 
+ We can estimate \((\beta, i)\) independently from known data about the proplyd and the wind.
+ \[
  \beta = \frac{\dot{M}_{\mathrm{eff}} V_{\mathrm{p}}} {\dot{M}_{\mathrm{w}} V_{\mathrm{w}}}
  \]
+ Effective proplyd mass-loss rate: \( \dot{M}_{\mathrm{eff}}\ = 4\pi r_0^2 n_0 m c_0 \)
+ We also have ionization balance
+ \[
  \frac{S_{\star}}{4 \pi D^2} = \alpha_{\mathrm{B}} n_0^2 \omega r_0
  \]
+ This implies that \(\dot{M}_{\mathrm{eff}} \propto r_0^{3/2} D^{-1}\) and \(\beta\) will go the same way, since the terminal velocity of the proplyd wind is not expected to vary much.
+ Alternatively, we could use the measured values of \(r_0\) and \(n_0\).  



** Distribution of proplyd sizes
:PROPERTIES:
:ID:       8C1F7790-DD52-48CF-9086-7E96163F19DE
:END:
+ I am measuring sizes for the Ricci (2008) sample with D' < 60 arcsec

*** Mis-classified objects
+ 168-235 :: high proper motion so clearly a jet knot
+ 187-314 :: has a star but no sign of proplyd: possibly has a jet knot or a binary companion
+ 160-253 :: from the proper motion looks like a complex jet knot that is going past a star
*** Objects with no obvious proplyd-morphology in H\alpha
+ 166-406 :: looks like proplyd from PC [O I] and [S II] images
  + present in Ricci catalog
+ 174-400 :: exactly the same as 166-406
  + *absent* from Ricci catalog
  + these two may be neutral proplyds


*** Obvious proplyds missing from Ricci catalog
+ 170-400 :: circular bright rim with dark disk inside
  + right on top of one of the HH529 shocks, which is why it might have been missed
+ 168-404 :: elliptical bright object - clearly not a point source - with bright star inside
+ 182-316 :: small proplyd with faint but well-defined tail
+ 181-401 :: a very faint tail, but definitely there
+ 153-321 :: looks most convincing in the Bally image
+ 171-334 :: has a bright star that makes the proplyd very hard to see.  Only obvious in [O III] PC images, where it is clearly extended
+ 
*** Shadow disks in the inner arcminute
+ 165-254 :: almost edge-on disk with reflection nebula
+ 167-231 :: circular disk with central star and the faintest of bright rims
  + I include this in the radius samples, but not the other two
+ 183-405 :: nice elliptical disk with star in middle
** TODO Variation in stellar wind
:PROPERTIES:
:orgtrello-id: 52091abb39ecbefd21004f7d
:END:
+ th1C is thought to be an oblique magnetic rotator
  + Stahl 1996 http://adsabs.harvard.edu/abs/1996A%26A...312..539S
  + period 15 days
  + angle \beta between magnetic axis and rotation axis \approx 45 deg
  + inclination i of rotation axis to line-of-sight \approx 45 deg
+ Papers on models of the wind
  + ud-Doula 2013 http://adsabs.harvard.edu/abs/2013MNRAS.428.2723U
+ Variation with latitude of \dot{M} and V_{\infty}
  + Do the papers give any information on this?
  + If not, we need to write to ud-Douls
+ Calculate relevant timescale for interaction of wind with proplyd:
  + t ~ R_{c} / V_{\infty}
  + Any shorter-scale variations in the wind will not affect the bowshocks
  + => average over orbital period will reduce the effects of variation with latitude of the wind parameters
  + We need to quantify this






** Analysis of external pressures 2016
+ Using the results from the conic section fits, we have \beta and i for each proplyd, assuming a value for \xi
  + Actually we have a range of possibilities because of the uncertainties in the fits
+ We can therefore find R0/D and D
+ And using the observed n_0 of the proplyd, we can estimate the stagnation pressure in the shell
+ We can plot this against distance and compare with what is expected for a simple stellar wind
*** Calculation of stagnation pressure
+ Pre-shock density in proplyd flow:
  + \( n = n_{0} (R_{0} / r_{0})^{-2} M^{-1} \)
+ Ram pressure at shell
  + \(P = n m M^{2} c_{s}^{2} = n_{0} m c_{s}^{2} M (R_{0} / r_{0})^{-2} \)
  + m = 1.3 m_{p} = 1.3 1.67262158e-24 g
  + c_s = 11 km/s
    + m c_s^2 = 2 k T
    + c_s = sqrt(2 k T / m) = 11.27 sqrt(T_4) km/s
  + Suppose M = 3
+ Stellar wind ram pressure
  + P = Mdot Vw / 4 pi D**2
  + Mdot = 3.5e-7 Msun/yr = 2.206e19 g/s
  + Vw = 1200 km/s = 1.2e8 cm/s
  + Scale of D is arcsec = 440 au = 6.582e15 cm

*** Measurements \xi = 0.8, 0.4, and 1.0 
:PROPERTIES:
:TABLE_EXPORT_FILE: wind-fits.tab
:TABLE_EXPORT_FORMAT: orgtbl-to-tsv
:END:

+ All lengths are in arc seconds
  + r0 is the ionization front radius
+ N6 is i-front density in units of 1e6 pcc
  + We divide the HA98 values by 2
+ Comparison of ionizing fluxes
  + F(photo) is flux required to balance the photoevapration flow
    + F = n c  + 0.12 r0 alpha n*2
  + F(star) is ionizing flux from star at that distance
    + F = (1 - f_d) Q_H / 4 pi D^2
    + Q_H = 1e49 / s
    + f_d is fraction absorbed by dust (assumed 0.5)
| Source  |  xi |    r0 |   N6 |    D' | R0'/D' | Rc'/R0' |  \beta |  i |  R0/D |     D |   R0 | R0/r0 |  P(in) | P(wind) | P(in)/P(wind) | F(photo) | F(star) | F(ph)/F(*) |
|---------+-----+-------+------+-------+--------+---------+--------+----+-------+-------+------+-------+--------+---------+---------------+----------+---------+------------|
| LV2     | 0.8 | 0.120 |  1.9 |  7.83 |   0.25 |     1.3 |  0.002 | 70 |  0.04 | 22.89 | 0.92 |  7.67 | 2.5e-7 |  9.3e-9 |         26.88 |   9.1e13 |  1.8e13 |       5.06 |
| LV2     | 0.4 | 0.120 |  1.9 |  7.83 |   0.28 |     1.1 |   0.01 | 64 |  0.09 | 17.86 | 1.61 | 13.42 | 8.3e-8 |  1.5e-8 |          5.53 |   9.1e13 |  2.9e13 |       3.14 |
| LV2     | 0.8 | 0.120 |  1.9 |  7.83 |   0.25 |     1.5 |   0.01 | 55 |  0.09 | 13.65 | 1.23 | 10.25 | 1.4e-7 |  2.6e-8 |          5.38 |   9.1e13 |  4.9e13 |       1.86 |
| LV2     | 0.4 | 0.120 |  1.9 |  7.83 |   0.25 |     1.2 |   0.02 | 55 |  0.12 | 13.65 | 1.64 | 13.67 | 8.0e-8 |  2.6e-8 |          3.08 |   9.1e13 |  4.9e13 |       1.86 |
| LV2     | 0.4 | 0.120 |  1.9 |  7.83 |   0.25 |    1.35 |  0.035 | 45 |  0.15 | 11.07 | 1.66 | 13.83 | 7.8e-8 |  4.0e-8 |          1.95 |   9.1e13 |  7.5e13 |       1.21 |
| LV2     | 0.4 | 0.120 |  1.9 |  7.83 |   0.25 |     1.5 |   0.05 | 35 |  0.18 |  9.56 | 1.72 | 14.33 | 7.3e-8 |  5.3e-8 |          1.38 |   9.1e13 |  1.0e14 |       0.91 |
|---------+-----+-------+------+-------+--------+---------+--------+----+-------+-------+------+-------+--------+---------+---------------+----------+---------+------------|
| LV2b    | 1.0 | 0.038 |  3.1 |  7.01 |  0.095 |     2.0 |  0.002 | 50 |  0.04 | 10.91 | 0.44 | 11.58 | 1.8e-7 |  4.1e-8 |          4.39 |   7.8e13 |  7.7e13 |       1.01 |
| LV2b    | 0.8 | 0.038 |  3.1 |  7.01 |  0.095 |     1.4 |  0.002 | 50 |  0.04 | 10.91 | 0.44 | 11.58 | 1.8e-7 |  4.1e-8 |          4.39 |   7.8e13 |  7.7e13 |       1.01 |
| LV2b    | 0.8 | 0.038 |  3.1 |  7.01 |  0.095 |    1.55 |  0.005 | 40 | 0.065 |  9.15 | 0.59 | 15.53 | 1.0e-7 |  5.8e-8 |          1.72 |   7.8e13 |  1.1e14 |       0.71 |
| LV2b    | 0.8 | 0.038 |  3.1 |  7.01 |  0.095 |     1.7 |   0.01 | 15 |  0.09 |  7.26 | 0.65 | 17.11 | 8.4e-8 |  9.2e-8 |          0.91 |   7.8e13 |  1.7e14 |       0.46 |
|---------+-----+-------+------+-------+--------+---------+--------+----+-------+-------+------+-------+--------+---------+---------------+----------+---------+------------|
| LV3     | 0.8 | 0.076 | 2.33 |  6.91 |   0.33 |     1.7 |   0.02 | 55 |  0.12 | 12.05 | 1.45 | 19.08 | 5.1e-8 |  3.3e-8 |          1.55 |   8.7e13 |  6.3e13 |       1.38 |
| LV3     | 0.8 | 0.076 | 2.33 |  6.91 |   0.33 |     2.0 |   0.05 | 40 |  0.18 |  9.02 | 1.62 | 21.32 | 4.0e-8 |  6.0e-8 |          0.67 |   8.7e13 |  1.1e14 |       0.79 |
| LV3     | 0.4 | 0.076 | 2.33 |  6.91 |   0.33 |     1.7 |    0.1 | 30 |  0.24 |  7.98 | 1.92 | 25.26 | 2.9e-8 |  7.6e-8 |          0.38 |   8.7e13 |  1.4e14 |       0.62 |
|---------+-----+-------+------+-------+--------+---------+--------+----+-------+-------+------+-------+--------+---------+---------------+----------+---------+------------|
| LV4     | 0.8 | 0.053 |  3.1 |  6.05 |  0.185 |     2.0 |   0.05 | 10 |  0.18 |  6.14 | 1.11 | 20.94 | 5.6e-8 |  1.3e-7 |          0.43 |   1.1e14 |  2.4e14 |       0.46 |
| LV4     | 1.0 | 0.053 |  3.1 |  6.05 |  0.185 |     2.0 |   0.05 | 10 |  0.18 |  6.14 | 1.11 | 20.94 | 5.6e-8 |  1.3e-7 |          0.43 |   1.1e14 |  2.4e14 |       0.46 |
| LV4     | 1.0 | 0.053 |  3.1 |  6.05 |  0.185 |     2.2 |   0.01 | 45 |  0.09 |  8.56 | 0.77 | 14.53 | 1.2e-7 |  6.6e-8 |          1.82 |   1.1e14 |  1.3e14 |       0.85 |
| LV4     | 1.0 | 0.053 |  3.1 |  6.05 |  0.185 |     2.3 |  0.005 | 50 | 0.065 |  9.41 | 0.61 | 11.51 | 1.8e-7 |  5.5e-8 |          3.27 |   1.1e14 |  1.0e14 |       1.10 |
| LV4     | 1.0 | 0.053 |  3.1 |  6.05 |  0.185 |     2.5 | 0.0005 | 70 | 0.025 | 17.69 | 0.44 |  8.30 | 3.6e-7 |  1.6e-8 |         22.50 |   1.1e14 |  2.9e13 |       3.79 |
|---------+-----+-------+------+-------+--------+---------+--------+----+-------+-------+------+-------+--------+---------+---------------+----------+---------+------------|
| LV5     | 0.8 | 0.096 | 1.75 |  9.42 |   0.22 |     1.5 |   0.01 | 55 |  0.09 | 16.42 | 1.48 | 15.42 | 5.8e-8 |  1.8e-8 |          3.22 |   6.2e13 |  3.4e13 |       1.82 |
| LV5     | 0.8 | 0.096 | 1.75 |  9.42 |   0.22 |    1.75 |   0.02 | 42 |  0.12 | 12.68 | 1.52 | 15.83 | 5.5e-8 |  3.0e-8 |          1.83 |   6.2e13 |  5.7e13 |       1.09 |
| LV5     | 0.4 | 0.096 | 1.75 |  9.42 |   0.22 |     1.6 |   0.05 | 25 |  0.18 | 10.39 | 1.87 | 19.48 | 3.6e-8 |  4.5e-8 |          0.80 |   6.2e13 |  8.5e13 |       0.73 |
|---------+-----+-------+------+-------+--------+---------+--------+----+-------+-------+------+-------+--------+---------+---------------+----------+---------+------------|
| 168-328 | 0.8 | 0.043 |  3.0 |  6.64 |  0.155 |     1.4 |  0.002 | 65 |  0.04 | 15.71 | 0.63 | 14.65 | 1.1e-7 |  2.0e-8 |          5.50 |   8.3e13 |  3.7e13 |       2.24 |
| 168-328 | 0.8 | 0.043 |  3.0 |  6.64 |  0.155 |     1.5 |  0.005 | 55 | 0.065 | 11.58 | 0.75 | 17.44 | 7.8e-8 |  3.6e-8 |          2.17 |   8.3e13 |  6.8e13 |       1.22 |
| 168-328 | 0.4 | 0.043 |  3.0 |  6.64 |  0.155 |     1.2 |   0.01 | 45 |  0.09 |  9.39 | 0.85 | 19.77 | 6.1e-8 |  5.5e-8 |          1.11 |   8.3e13 |  1.0e14 |       0.83 |
| 168-328 | 0.4 | 0.043 |  3.0 |  6.64 |  0.155 |     1.5 |   0.02 | 30 |  0.12 |  7.67 | 0.92 | 21.40 | 5.2e-8 |  8.3e-8 |          0.63 |   8.3e13 |  1.6e14 |       0.52 |
|---------+-----+-------+------+-------+--------+---------+--------+----+-------+-------+------+-------+--------+---------+---------------+----------+---------+------------|
| 169-338 | 0.8 | 0.043 | 1.05 | 16.47 |   0.06 |     1.3 | 0.0005 | 60 | 0.025 | 32.94 | 0.82 | 19.07 | 2.3e-8 |  4.5e-9 |          5.11 |   1.1e13 |  8.5e12 |       1.29 |
| 169-338 | 0.8 | 0.043 | 1.05 | 16.47 |   0.06 |    1.45 |  0.001 | 50 |  0.03 | 25.62 | 0.77 | 17.91 | 2.6e-8 |  7.4e-9 |          3.51 |   1.1e13 |  1.4e13 |       0.79 |
| 169-338 | 0.8 | 0.043 | 1.05 | 16.47 |   0.06 |    1.55 |  0.002 | 35 |  0.04 | 20.11 | 0.80 | 18.60 | 2.4e-8 |  1.2e-8 |          2.00 |   1.1e13 |  2.3e13 |       0.48 |
| 169-338 | 0.8 | 0.043 | 1.05 | 16.47 |   0.06 |     1.6 |  0.004 |  0 |  0.06 | 16.47 | 0.99 | 23.02 | 1.6e-8 |  1.8e-8 |          0.89 |   1.1e13 |  3.4e13 |       0.32 |
|---------+-----+-------+------+-------+--------+---------+--------+----+-------+-------+------+-------+--------+---------+---------------+----------+---------+------------|
| 177-341 | 0.8 | 0.310 | 0.31 | 25.84 |   0.14 |     1.2 | 0.0005 | 75 | 0.025 | 99.84 | 2.50 |  8.06 | 3.8e-8 | 4.9e-10 |         77.55 |   6.5e12 |  9.2e11 |       7.07 |
| 177-341 | 0.8 | 0.310 | 0.31 | 25.84 |   0.14 |     1.3 |  0.001 | 70 |  0.03 | 75.55 | 2.27 |  7.32 | 4.6e-8 | 8.5e-10 |         54.12 |   6.5e12 |  1.6e12 |       4.06 |
| 177-341 | 0.4 | 0.310 | 0.31 | 25.84 |   0.14 |     1.2 |  0.007 | 52 | 0.072 | 41.97 | 3.02 |  9.74 | 2.6e-8 |  2.8e-9 |          9.29 |   6.5e12 |  5.2e12 |       1.25 |
| 177-341 | 0.4 | 0.310 | 0.31 | 25.84 |   0.14 |     1.3 |   0.01 | 45 |  0.08 | 36.54 | 2.92 |  9.42 | 2.8e-8 |  3.6e-9 |          7.78 |   6.5e12 |  6.9e12 |       0.94 |
|---------+-----+-------+------+-------+--------+---------+--------+----+-------+-------+------+-------+--------+---------+---------------+----------+---------+------------|
| 180-331 | 0.4 | 0.185 | 0.36 | 25.12 |   0.06 |     1.3 |  0.002 | 30 |  0.04 | 29.01 | 1.16 |  6.27 | 7.2e-8 |  5.8e-9 |         12.41 |   5.3e12 |  1.1e13 |       0.48 |
| 180-331 | 0.4 | 0.185 | 0.36 | 25.12 |   0.08 |     1.3 |  0.005 | 30 |  0.07 | 29.01 | 2.03 | 10.97 | 2.4e-8 |  5.8e-9 |          4.14 |   5.3e12 |  1.1e13 |       0.48 |
| 180-331 | 0.4 | 0.185 | 0.36 | 25.12 |   0.06 |     1.2 |  0.002 | 45 |  0.04 | 35.53 | 1.42 |  7.68 | 4.8e-8 |  3.9e-9 |         12.31 |   5.3e12 |  7.3e12 |       0.73 |
| 180-331 | 0.8 | 0.185 | 0.36 | 25.12 |   0.05 |     1.3 | 0.0005 | 55 | 0.025 | 43.80 | 1.10 |  5.95 | 8.0e-8 |  2.5e-9 |         32.00 |   5.3e12 |  4.8e12 |       1.10 |
| 180-331 | 0.8 | 0.185 | 0.36 | 25.12 |  0.075 |     1.3 | 0.0005 | 65 | 0.025 | 59.44 | 1.49 |  8.05 | 4.4e-8 |  1.4e-9 |         31.43 |   5.3e12 |  2.6e12 |       2.04 |
#+TBLFM: $11=$5/cos($9);f2::$12=$-1 $-2; f2::$13=$-1/$3;f2::$14=1e6 $4 1.3 $mp (11 $km)**2 3 / $-1**2; s2::$15=2.206e19 1.2e8 / 4 $pi ($11 6.582e15)**2; s2::$16=$-2/$-1;f2::$17=1e6 $4 11 $km + 0.12 $3 440 $au 2.6e-13 (1e6 $4)**2; s2::$18=0.5 1e49 / 4 $pi ($11 440 $au)**2; s2::$19=$-2/$-1; f2


*** Plots of the above table
+ The table is written to [[file:wind-fits.tab]]
+ The plots are done in [[file:~/Work/Bowshocks/Jorge/bowshock-shape/proplyd-wind-figs/plot-wind-fits.py][proplyd-wind-figs/plot-wind-fits.py]]


** New table of relevant proplyds
:PROPERTIES:
:orgtrello-id: 52091abc9e9ef89a200058c5
:END:

+ From GAH 2002
  + \(V_{\mathrm{w}} = 1200~\mathrm{km\ s^{-1}}\)
  + \(\dot{M}_{\mathrm{w}} = 3.5 \times 10^{-7} M_{\odot}\ \mathrm{yr^{-1}} \)
+ which means that \(\beta\) is 
  + 4 $pi (1e14 $r14)**2 1e6 $N6 1.3 $mp (13.0 $km) (3.0 13.0 $km) / (3.5e-7 $Msun / $yr) (1200 $km)

| ! |        |       ID |     d |  r14 |  dr | dalph | dal | inc | dinc |  D17 |    N6 |  tau | beta            |   r_as |
|---+--------+----------+-------+------+-----+-------+-----+-----+------+------+-------+------+-----------------+-------|
| * | SC3    |  163-323 |  2.14 |  2.2 | 0.6 |     0 |  19 |  45 |   45 | 0.21 | 14.30 | 0.60 | 0.036 +/- 0.020 | 0.033 |
| * | LV4    |  161-324 |  6.05 |  3.5 | 0.3 |     7 |   6 |  45 |   15 | 0.59 |  6.21 | 0.48 | 0.040 +/- 0.007 | 0.053 |
| * | LV1b   | 168-326W |  6.34 |      |     |       |     |     |      |      |       |      | 0.000           | 0.000 |
| * | LV1    | 168-326E |  6.60 |  6.3 | 0.6 |    12 |  10 |  60 |   15 | 0.52 |  3.52 | 0.50 | 0.073 +/- 0.014 | 0.096 |
| * | *      |  168-328 |  6.64 |  2.8 | 0.3 |     0 |   5 |  30 |   15 | 0.91 |  6.03 | 0.38 | 0.025 +/- 0.005 | 0.043 |
| * | LV3    |  163-317 |  6.91 |  5.0 | 0.6 |     0 |  10 |  45 |   15 | 0.67 |  4.66 | 0.54 | 0.061 +/- 0.015 | 0.076 |
| * | LV2b   |  166-316 |  7.01 |  2.5 | 0.6 |    12 |   7 |  30 |   30 | 0.97 |  6.21 | 0.36 | 0.020 +/- 0.010 | 0.038 |
| * |        |  161-328 |  7.74 |  9.1 | 1.0 |    27 |   5 |  45 |    7 | 0.75 |  0.86 | 0.18 | 0.037 +/- 0.008 | 0.138 |
| * | LV2    |  167-317 |  7.83 |  7.9 | 0.3 |     3 |   1 |  60 |    7 | 0.62 |  3.86 | 0.70 | 0.126 +/- 0.010 | 0.120 |
| * | LV5    |  158-323 |  9.42 |  6.3 | 0.6 |     0 |   5 |  45 |   15 | 0.92 |  3.50 | 0.52 | 0.073 +/- 0.014 | 0.096 |
| * |        |  158-326 |  9.60 | 11.3 | 0.6 |     0 |   6 |  15 |   15 | 2.55 |  1.12 | 0.28 | 0.075 +/- 0.008 | 0.172 |
| * |        |  161-314 | 10.24 |  5.3 | 1.9 |     0 |  60 |  30 |    0 | 4.06 |  1.02 | 0.12 | 0.015 +/- 0.011 | 0.081 |
| * | LV6    |  158-327 | 10.60 | 16.6 | 1.6 |     0 |   5 |  45 |    7 | 1.03 |  0.78 | 0.29 | 0.112 +/- 0.022 | 0.252 |
| * | LV5b   |  157-323 | 10.97 |  2.5 | 0.3 |     0 |   3 |  60 |   15 | 0.87 |  6.07 | 0.34 | 0.020 +/- 0.005 | 0.038 |
| * |        |  171-334 | 14.29 |  4.7 | 0.3 |    35 |   8 |  45 |   45 | 1.39 |  3.49 | 0.41 | 0.040 +/- 0.005 | 0.071 |
| * | HST2   |  170-337 | 16.20 | 12.2 | 1.2 |     0 |  15 |  60 |   60 | 1.29 |  1.19 | 0.33 | 0.093 +/- 0.018 | 0.185 |
| * |        |  176-325 | 16.38 |  6.9 | 1.0 |    10 |   1 |  75 |   15 | 1.17 |  1.59 | 0.29 | 0.040 +/- 0.011 | 0.105 |
| * | *      |  169-338 | 16.47 |  2.8 | 0.3 |     6 |   3 |  75 |   75 | 1.17 |  2.10 | 0.15 | 0.009 +/- 0.002 | 0.043 |
| * |        |  154-324 | 16.63 |  3.2 | 0.3 |    18 |   5 |  45 |   45 | 1.62 |  2.59 | 0.17 | 0.014 +/- 0.003 | 0.049 |
| * |        | 161-307W | 16.85 |      |     |       |     |     |      |      |       |      | 0.000           | 0.000 |
| * |        |  153-321 | 16.97 |  1.2 | 0.3 |     0 |  14 |  45 |   45 | 1.65 |  6.33 | 0.17 | 0.005 +/- 0.002 | 0.018 |
| * |        |  159-338 | 17.20 |  5.0 | 0.3 |     8 |   2 |  75 |   15 | 1.23 |  2.29 | 0.26 | 0.030 +/- 0.004 | 0.076 |
| * | HST 11 |  171-340 | 19.11 | 23.3 | 1.6 |     0 |   4 |  45 |   45 | 1.86 |  0.22 | 0.12 | 0.063 +/- 0.009 | 0.354 |
| * |        |  152-319 | 19.16 | 18.2 | 2.2 |     0 |  13 |  30 |   15 | 2.64 |  0.28 | 0.12 | 0.049 +/- 0.012 | 0.276 |
| * |        |  155-338 | 20.48 | 17.0 | 2.5 |     0 |   2 |  30 |    7 | 2.82 |  0.70 | 0.28 | 0.106 +/- 0.031 | 0.258 |
| * | HST 12 |  173-341 | 22.48 |  4.1 | 0.3 |    12 |   8 |  30 |   30 | 3.09 |  1.72 | 0.19 | 0.015 +/- 0.002 | 0.062 |
| * |        |  159-302 | 22.75 |  4.4 | 0.6 |     0 |  20 |  60 |   60 | 1.81 |  1.30 | 0.13 | 0.013 +/- 0.004 | 0.067 |
| * | *      |  180-331 | 25.12 | 12.2 | 1.2 |    15 |   3 |  60 |    7 | 2.00 |  0.73 | 0.23 | 0.057 +/- 0.011 | 0.185 |
| * | HST 1  |  177-341 | 25.84 | 20.4 | 1.6 |     8 |   2 |  60 |    7 | 2.05 |  0.62 | 0.29 | 0.135 +/- 0.021 | 0.310 |
| * |        |  154-346 | 27.21 |  1.9 | 0.3 |     0 |   1 |  75 |   15 | 1.94 |  5.51 | 0.32 | 0.010 +/- 0.003 | 0.029 |
| * | HST 3  |  159-350 | 28.35 | 20.1 | 1.6 |    18 |   2 |  75 |   15 | 2.02 |  0.65 | 0.30 | 0.137 +/- 0.022 | 0.305 |
| * |        |  160-353 | 30.79 |      |     |       |     |     |      |      |       |      | 0.000           | 0.000 |
|---+--------+----------+-------+------+-----+-------+-----+-----+------+------+-------+------+-----------------+-------|
|   |        |          |       |      |     |       |     |     |      |      |       |      |                 |       |
#+TBLFM: $14=4 $pi (1e14 ($r14 +/- $dr))**2 1e6 $N6 1.3 $mp (13.0 $km) (3.0 13.0 $km) / (3.5e-7 $Msun / $yr) (1200 $km) ; f3::$15=$r14 1e14 / 440 $au ;f3

** Original table from Henney & Arthur (1998)
:PROPERTIES:
:orgtrello-id: 52091abc13ecaa6c2e002faf
:END:

Copied from [[file:~/Dropbox/Proplyds07/Proplyd2005/Sizes/proplyd-sizes.org]]

| ! |       ID |     d |  r14 |  dr | dalph | dal | inc | dinc |  D17 |    N6 |  tau | Omega/4pi         |
|---+----------+-------+------+-----+-------+-----+-----+------+------+-------+------+-------------------|
| * |  163-323 |  2.14 |  2.2 | 0.6 |     0 |  19 |  45 |   45 | 0.21 | 14.30 | 0.60 | 3.7e-5 +/- 3.5e-5 |
| * |  161-324 |  6.05 |  3.5 | 0.3 |     7 |   6 |  45 |   15 | 0.59 |  6.21 | 0.48 | 1.2e-5 +/- 3.7e-6 |
| * | 168-326W |  6.34 |      |     |       |     |     |      |      |       |      | 0.                |
| * | 168-326E |  6.60 |  6.3 | 0.6 |    12 |  10 |  60 |   15 | 0.52 |  3.52 | 0.50 | 4.8e-5 +/- 1.2e-5 |
| * |  168-328 |  6.64 |  2.8 | 0.3 |     0 |   5 |  30 |   15 | 0.91 |  6.03 | 0.38 | 3.1e-6 +/- 1.6e-6 |
| * |  163-317 |  6.91 |  5.0 | 0.6 |     0 |  10 |  45 |   15 | 0.67 |  4.66 | 0.54 | 1.8e-5 +/- 6.5e-6 |
| * |  166-316 |  7.01 |  2.5 | 0.6 |    12 |   7 |  30 |   30 | 0.97 |  6.21 | 0.36 | 2.2e-6 +/- 2.3e-6 |
| * |  161-328 |  7.74 |  9.1 | 1.0 |    27 |   5 |  45 |    7 | 0.75 |  0.86 | 0.18 | 4.8e-5 +/- 1.2e-5 |
| * |  167-317 |  7.83 |  7.9 | 0.3 |     3 |   1 |  60 |    7 | 0.62 |  3.86 | 0.70 | 5.3e-5 +/- 5.5e-6 |
| * |  158-323 |  9.42 |  6.3 | 0.6 |     0 |   5 |  45 |   15 | 0.92 |  3.50 | 0.52 | 1.6e-5 +/- 5.1e-6 |
| * |  158-326 |  9.60 | 11.3 | 0.6 |     0 |   6 |  15 |   15 | 2.55 |  1.12 | 0.28 | 6.5e-6 +/- 6.4e-6 |
| * |  161-314 | 10.24 |  5.3 | 1.9 |     0 |  60 |  30 |    0 | 4.06 |  1.02 | 0.12 | 4.7e-6 +/- 3.4e-6 |
| * |  158-327 | 10.60 | 16.6 | 1.6 |     0 |   5 |  45 |    7 | 1.03 |  0.78 | 0.29 | 8.6e-5 +/- 2.0e-5 |
| * |  157-323 | 10.97 |  2.5 | 0.3 |     0 |   3 |  60 |   15 | 0.87 |  6.07 | 0.34 | 2.7e-6 +/- 7.7e-7 |
| * |  171-334 | 14.29 |  4.7 | 0.3 |    35 |   8 |  45 |   45 | 1.39 |  3.49 | 0.41 | 3.8e-6 +/- 3.0e-6 |
| * |  170-337 | 16.20 | 12.2 | 1.2 |     0 |  15 |  60 |   60 | 1.29 |  1.19 | 0.33 | 3.0e-5 +/- 1.9e-5 |
| * |  176-325 | 16.38 |  6.9 | 1.0 |    10 |   1 |  75 |   15 | 1.17 |  1.59 | 0.29 | 1.2e-5 +/- 3.4e-6 |
| * |  169-338 | 16.47 |  2.8 | 0.3 |     6 |   3 |  75 |   75 | 1.17 |  2.10 | 0.15 | 1.9e-6 +/- 7.7e-7 |
| * |  154-324 | 16.63 |  3.2 | 0.3 |    18 |   5 |  45 |   45 | 1.62 |  2.59 | 0.17 | 1.3e-6 +/- 1.0e-6 |
| * | 161-307W | 16.85 |      |     |       |     |     |      |      |       |      | 0.                |
| * |  153-321 | 16.97 |  1.2 | 0.3 |     0 |  14 |  45 |   45 | 1.65 |  6.33 | 0.17 | 1.7e-7 +/- 1.6e-7 |
| * |  159-338 | 17.20 |  5.0 | 0.3 |     8 |   2 |  75 |   15 | 1.23 |  2.29 | 0.26 | 5.5e-6 +/- 7.7e-7 |
| * |  171-340 | 19.11 | 23.3 | 1.6 |     0 |   4 |  45 |   45 | 1.86 |  0.22 | 0.12 | 5.2e-5 +/- 4.1e-5 |
| * |  152-319 | 19.16 | 18.2 | 2.2 |     0 |  13 |  30 |   15 | 2.64 |  0.28 | 0.12 | 1.6e-5 +/- 8.1e-6 |
| * |  155-338 | 20.48 | 17.0 | 2.5 |     0 |   2 |  30 |    7 | 2.82 |  0.70 | 0.28 | 1.2e-5 +/- 4.4e-6 |
| * |  173-341 | 22.48 |  4.1 | 0.3 |    12 |   8 |  30 |   30 | 3.09 |  1.72 | 0.19 | 5.8e-7 +/- 5.3e-7 |
| * |  159-302 | 22.75 |  4.4 | 0.6 |     0 |  20 |  60 |   60 | 1.81 |  1.30 | 0.13 | 2.0e-6 +/- 1.3e-6 |
| * |  180-331 | 25.12 | 12.2 | 1.2 |    15 |   3 |  60 |    7 | 2.00 |  0.73 | 0.23 | 1.2e-5 +/- 2.6e-6 |
| * |  177-341 | 25.84 | 20.4 | 1.6 |     8 |   2 |  60 |    7 | 2.05 |  0.62 | 0.29 | 3.3e-5 +/- 5.6e-6 |
| * |  154-346 | 27.21 |  1.9 | 0.3 |     0 |   1 |  75 |   15 | 1.94 |  5.51 | 0.32 | 3.2e-7 +/- 1.0e-7 |
| * |  159-350 | 28.35 | 20.1 | 1.6 |    18 |   2 |  75 |   15 | 2.02 |  0.65 | 0.30 | 3.3e-5 +/- 5.7e-6 |
| * |  160-353 | 30.79 |      |     |       |     |     |      |      |       |      | 0.                |
|---+----------+-------+------+-----+-------+-----+-----+------+------+-------+------+-------------------|
|   |          |       |      |     |       |     |     |      |      |       |      | 5.5e-4 +/- 6.6e-5 |
#+TBLFM: $13=1.21 (1.e14 ($r14 +/- $dr))**2 / 4 ($d 440 $au / sin($inc +/- (0.5 $dinc)))**2 ; n2::@34$13=vsum(@I..@II); n2




* Return to theoretical shapes and approximations thereof

** Statistical study of projected shapes
+ Compare with Luis sample results for A' vs q'
+ We already have A' versus q'/q graphs for all conic sections
+ Combine with A(\beta) and q(\beta) curves
+ Use Monte Carlo to generate a cloud of points
+ Distributed in radius according to some law
*** Going from \beta to A and q and \theta
+ For the moment, we will just do the CD - add in the modification for the inner shock later.
+ Jorge's radii.pdf gives most of the formulae
+ For CRW isotropic and proplyd cases:
  + q \equiv R_0/D = \beta^{1/2}/(1 + \beta^{1/2})
  + A \equiv R_c/R_0 = 1.5/(1 - \beta^{1/2})
+ B \equiv R_{90} / R_{0 }depends on type:
  + isotropic:
    + B = 3^{1/2 }(1 + \beta^{1/2}))
    + tan \theta_c = {3 [(1 - \beta^{1/2})^{-1} - (1 + \beta^{1/2})^{2}]}^{1/2}
*** Some general points
+ Mostly, A'/A < 1 and falls with inclination
  + Exceptions are with hyperbolae: for smallish A, A' starts to climb.  Also, A' curves up steeply just before reaching the maximum inclination (but this is unlikely to be seen, since it is over only a small range in i)

** Summary of current results
+ We have the analytic CRW results for both proplyd and isotropic case
+ We have circular fits to both
  + The parameter A describes the radius of curvature: A = R_c/R_0
  + We have a figure showing how this varies with momentum ratio: \beta
    + [[file:~/Work/Bowshocks/Jorge/bowshock-shape/AVSb.pdf][AVSb.pdf]]
    + Created by [[AvsBeta.py]]
  + /But this is contradicted by our work on the small-angle expansion of the CRW and proplyd shapes/
    + Jorge found that the on-axis Rc was identical for proplyd and isotropic cases
    + This can perhaps be reconciled since the R_{c} we measured here is a compromise value, fit to the curve from \theta = 0 \to 45\deg^{}, and is not necessarily equal to the on-axis value. 
+ We have calculated the projection effects on this A \to A\prime
  + /but we don't fully understand them/
** What still needs to be done
*** Understanding the difference between the proplyd and isotropic cases
+ We should compare shapes that have the same value of A
  + 1/A = y0 (e^{-\beta^{d}/b} - c) / (1 - c)
  + => \beta = -{b ln [ (1 - c)/(A y_0) + c]}^{1/d
  + For instance, A = 1.8 corresponds to 
    + Proplyd \beta = 0.02
    + Isotropic \beta = 0.001
*** DONE More approximations to the shell shape
CLOSED: [2014-05-06 Tue 23:11]
+ Circle: this works for \theta < 45\deg 
+ [X] Hyperbola/ellipse: still to do, should work better out to larger angles
  + [X] \theta vs \theta\prime
    + Do this in [[file:~/Work/Bowshocks/Jorge/bowshock-shape/Ellipse%20projection.ipynb][file:~/Work/Bowshocks/Jorge/bowshock-shape/Ellipse projection.ipynb]]
  + [X] R_{c}\prime/R_{0}\prime vs R_{0}\prime/D\prime
    + This is done for the circle \to ellipse \to parabola sequence in [[https://www.evernote.com/shard/s36/sh/821ee470-13aa-467d-9543-41062d406f08/f974d7b44c31e2b9a8f31e8fead6301a][these notes]]
    + [X] We still need to extend this to hyperbolae
      + DONE [2014-05-06 Tue] 

+ [X] R = 1 / cos(a \theta): still to do CANCELLED
  + This can fit the wings by construction since R \to \infty as \theta \to \pi/2a = \theta_{\infty}
  + But it doesn't work so well for \theta = 0 \to 120, which is the most important
  + Can be improved by taking 1 / cos^b(a \theta) with b = 1.4 but it isn't clear that the extra complication is worth it
+ [X] Small angle approximations to the CRW and modified CRW results
  + This should at least give us the radius of curvature on the axis
  + DONE [2014-05-06 Tue] Hand-written version in Evernote
    + And Jorge is writing it up in LaTeX
*** Finite thickness of inner shell
+ Necessary for calculating path length through shell
+ But also may affect the apparent shape of the shell
  + The shell brightness peak at each \theta will not be at the contact discontinuity, but will be offset by some fraction of h
  + Fraction of 0.5 if density is constant across shell, but in general it will vary:
    + On the axis, we know that density increases from shock to CD, so peak will be closer to CD than shock
      + For example, R - 0.3 h
    + For \beta > Mach angle (20\deg for M = 3) then shell flow is supersonic and divergent (probably), so density will /decrease/ from shock to CD, so brightness peak will be closer to the shock
      + For example, R - 0.7 h
  + We also have that h increases as some power of 1/cos\beta
    + Power index between 3 and 4 for the plane CD case
    + Still unknown for the curved CD case

* TODO Measure widths to calculate Mach number
:PROPERTIES:
:orgtrello-id: 52091abd0b1556e1050021a6
:END:

** Empirical measurements
:PROPERTIES:
:orgtrello-id: 52091abd0a34fc67310038e5
:END:
+ Jorge can do this
+ On the symmetry axis
+ Measure h'/R_{0}'
** Theoretical estimation
:PROPERTIES:
:orgtrello-id: 52091abe939d72bc49001c1f
:END:
+ h/R_{0} = k / M^{2} (para M >> 1)
  + Find constant k
  + Find how it is modified for small M
  + See Henney (2002) sec 4.3
+ Need to work out how this varies with inclination
  + h/R_{0} => h'/R_{0}'
** Relationship between projected FWHM, \Delta, and real width, h, for spherical homogeneous shells
:LOGBOOK:
CLOCK: [2013-09-18 Wed 23:39]--[2013-09-18 Wed 23:50] =>  0:11
:END:
+ Assuming the following:
  + spherical shell of outer radius R
  + and thickness H
  + constant emission coefficient, \eta 
+ Find surface brightness as function of projected radius, r
  + S(r) = \eta s(r)
  + s(r) is path length through shell
+ For r > R - H:
  + s_1(r) = 2 sqrt(R^2 - r^2)
+ For r < R - H:
  + s_2(r) = 2 {sqrt(R^2 - r^2) - sqrt[ (R - H)^2 - r^2 ]}
+ Maximum occurs at r = R - H: 
  + s_0 =  2 sqrt(R^2 - (R - H)^2 )= 2 sqrt((R^2 - (R^2 -2 R H + H^2)) = 2 sqrt[ H (2 R - H) ]
+ We can eliminate r in favour of X = R - r => r = R - X
+ {0 < X < H} : s_1(r) = 2 sqrt(R^2 - R^2 + 2R X - X^2) = 2 sqrt(X (2R - X))
+ {X > H} : s_2(r) = 2 sqrt(X (2R - X)) - 2 sqrt( R^2 - 2R H + H^2 - R^2 + 2R X - X^2)
  =  2 sqrt(X (2R - X)) - 2 sqrt( X (2R - X) - H (2R - H) )
+ Write h = H/R , x = X/H 
+ => s_1/s_0 = sqrt[ (X (2R - X) / H (2 R - H) ] = sqrt[ (X/H) (2 - X/R) / (2 - H/R)
+ => s_1/s_0 = sqrt[ x (2 - x h) / (2 - h) ]
+ and s_2/s_0 = sqrt[ x (2 - x h) / (2 - h) ] - sqrt{ [x (2 - x h) / (2 - h)] - 1 }
+ => s_2/s_0 =  sqrt[ x (2 - x h) / (2 - h) ] - sqrt( (x - 1) / (2 - h) ) = [sqrt(x(2 - xh)) - sqrt(x - 1)] / sqrt(2 - h)
  + Working: x (2 - x h) - (2 - h) = 2x - xh - 2 + h = -2 (1 - x) + h (1 - x) = (h - 2) ( 1 - x)  = (2 - h) (x - 1)
  + Remember x > 1 for s_2


* Measure shell densities to estimate stagnation pressure
:PROPERTIES:
:orgtrello-id: 52091abe161405ed7b001390
:END:
+ Use Ha surface brightness and model caclulation of path length




* Theoretical confining pressure from nebular photoevaporation flows

|  M_1 | n_1/n_0 | D/D_0 \alpha=2 | D/D_0 \alpha=1 | n_2/n_0 |
|-----+-------+----------+----------+-------|
| 1.2 |  0.80 |     1.02 |     1.04 |  1.15 |
| 1.5 |  0.54 |     1.11 |     1.23 |  1.22 |
| 2.0 |  0.22 |     1.51 |     2.27 |  0.88 |
| 2.5 |  0.07 |     2.39 |     5.71 |  0.44 |
| 3.0 |  0.02 |     4.08 |    16.67 |  0.18 |
#+TBLFM: $2=exp(-0.5 ($1**2 - 1)) ; f2::$3=sqrt(1/($2 $1));f2::$4=1/($2 $1);f2::$5=$1**2 $2 ; f2


** Semi-local flows
First, suppose M_1 = 2

|   D' | (D_0)' |    n_0 |    n_2 | log(P_2) |
|------+-------+-------+-------+---------|
|  1.0 |  0.66 | 7723. | 6796. |   -8.03 |
|  3.0 |  1.99 | 1840. | 1619. |   -8.65 |
| 10.0 |  6.62 |  386. |  340. |   -9.33 |
#+TBLFM: $2=$1/1.51 ;f2::$3=4500 $2**(-1.3) ;f0::$4=0.88 $-1;f0::$5=log10($k 1e4 $-1);f2

M_1 = 1.5

|   D' | (D_0)' |    n_0 |    n_2 | log(P_2) |
|------+-------+-------+-------+---------|
|  1.0 |  0.90 | 5161. | 6296. |   -8.06 |
|  3.0 |  2.70 | 1237. | 1509. |   -8.68 |
| 10.0 |  9.01 |  258. |  315. |   -9.36 |
#+TBLFM: $2=$1/1.11 ;f2::$3=4500 $2**(-1.3) ;f0::$4=1.22 $-1;f0::$5=log10($k 1e4 $-1);f2

M_1 = 3.0
|   D' | (D_0)' |     n_0 |    n_2 | log(P_2) |
|------+-------+--------+-------+---------|
|  1.0 |  0.25 | 27283. | 4911. |   -8.17 |
|  3.0 |  0.74 |  6656. | 1198. |   -8.78 |
| 10.0 |  2.45 |  1404. |  253. |   -9.46 |
#+TBLFM: $2=$1/4.08 ;f2::$3=4500 $2**(-1.3) ;f0::$4=0.18 $-1;f0::$5=log10($k 1e4 $-1);f2

** Global flow
Use fixed D_0 = 1 arcmin
| (D_0)' |   M_1 |   n_0 |    n_2 | log(P_2) |   D' |
|-------+------+------+-------+---------+------|
|   1.0 |  1.0 | 4500 | 4500. |   -8.21 |  1.0 |
|   1.0 |  1.5 | 4500 | 5420. |   -8.13 |  1.1 |
|   1.0 |  2.0 | 4500 | 4016. |   -8.26 |  1.5 |
|   1.0 | 2.72 | 4500 | 1358. |   -8.73 |  3.0 |
|   1.0 | 3.57 | 4500 |  162. |   -9.65 | 10.0 |
#+TBLFM: $4=$-1 $2**2 exp(-0.5 ($2**2 - 1));f0::$5=log10($k 1e4 $-1);f2::$6=sqrt(1/($2 exp(-0.5 ($2**2 - 1))));f1




* Export options
#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+OPTIONS: author:nil c:nil creator:nil d:(not "LOGBOOK") date:t e:t
#+OPTIONS: email:nil f:t inline:t num:t p:nil pri:nil prop:nil stat:t
#+OPTIONS: tags:t tasks:t tex:t timestamp:t title:t toc:nil todo:t |:t
#+TITLE: analysis
#+LANGUAGE: en
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport
